class Constants:
    rules = """
     <b>Правила использования бота:</b>

    1️⃣ <b>Цель и назначение бота:</b>
        - Бот предназначен для создания и управления чатами на основе выбранных тем, предоставляя удобную платформу для общения и обмена идеями.
        - Разработчик не несет ответственности за содержание чатов и сообщения пользователей, а также за действия, происходящие в этих чатах.

    2️⃣ <b>Ожидаемое поведение:</b>
        - Все пользователи должны соблюдать нормы вежливости и уважения друг к другу.
        - Важно создавать и поддерживать дружественную атмосферу в чатах, способствующую конструктивному общению и обмену знаниями. 

    3️⃣ <b>Обязанности создателей чатов:</b>
        - <b>Ответственность за контент:</b>
            - Создатели чатов несут ответственность за содержание своих чатов. Это включает текстовые сообщения, ссылки, изображения и любые другие материалы, размещенные в чатах.
            - Чаты не должны содержать информацию, нарушающую законы, правила площадки или моральные нормы.
        
        - <b>Запрещенные действия:</b>
            - Создатели чатов обязаны следить за тем, чтобы в чатах не было размещено спама, рекламы, фальшивой информации, агрессии, оскорблений, насилия, расизма, экстремизма или других запрещенных материалов.
            - Запрещается использование чатов для организации незаконной деятельности.
        
        - <b>Модерация чатов:</b>
            - Создатели чатов обязаны обеспечивать соответствующую модерацию в чатах. Они должны реагировать на нарушения и, при необходимости, блокировать пользователей, нарушающих правила.
            - Разработчик оставляет за собой право вмешиваться в случае серьезных нарушений или жалоб от других пользователей.

    4️⃣ <b>Правила для всех пользователей:</b>
        - <b>Этика общения:</b>
            - Все пользователи должны поддерживать доброжелательное и уважительное общение. Оскорбления, угрозы или дискриминация по любому признаку неприемлемы.
            - Не допускается размещение материалов, содержащих насилие, расизм, сексизм, экстремизм, порнографию или другие вредоносные элементы.
        
        - <b>Ответственность за действия:</b>
            - Пользователи несут полную ответственность за свои действия, включая размещение контента в чатах. Бот не несет ответственности за последствия, вызванные нарушением этих правил.
            - Пользователи должны уважать права других участников чатов и соблюдать правила платформы.
        
        - <b>Соблюдение законов:</b>
            - Все действия в рамках использования бота должны соответствовать действующему законодательству. Пользователи обязаны следить за тем, чтобы их поведение не нарушало законов, в том числе тех, что касаются интеллектуальной собственности, приватности и безопасности данных.

    5️⃣ <b>Общие положения:</b>
        - <b>Изменения в правилах:</b>
            - Разработчик оставляет за собой право изменять эти правила в любой момент. Все изменения будут опубликованы в обновленных версиях правил, и пользователи обязаны ознакомиться с ними.
        
        - <b>Поддержка и помощь:</b>
            - В случае возникновения вопросов или необходимости в поддержке пользователи могут обращаться к службе поддержки. Команда всегда готова помочь с любыми техническими или организационными проблемами.

        - <b>Подтверждение согласия:</b>
            - Использование бота означает согласие с вышеуказанными правилами. Пользователи могут быть заблокированы или удалены из чатов в случае их нарушения.

    Главное - <b>enjoy</b>.
"""
